Revit 2026 API

# ReinforcementRoundingManager Methods

---

The ReinforcementRoundingManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLengthUnitTypeId | Gets the identifier of the length unit quantifying the reinforcement rounding values. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ReinforcementRoundingManager Class

Autodesk.Revit.DB.Structure Namespace